<a href="https://colab.research.google.com/github/Mildredkulei7/Moringa_prep_w2/blob/main/Copy_of_SQL_Programming_Subqueries_using_Select_Statements.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# SQL Programming - Subqueries using Select Statements

## 1.0 Connecting to our Database

In [5]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

## 1.1 Loading Data from CSV Files

Datasets used in this notebook:


1.   **World Countries**

> ([Dataset Download Link](https://drive.google.com/a/moringaschool.com/file/d/1XlabneVWhvbmpRUi_Wix2FR5uYAAp-ZY/view?usp=sharing))

2.   **World Cities** 

> ([Dataset Download Link](https://drive.google.com/a/moringaschool.com/file/d/1R5952m-8hH91uiwDK8dcL9sT2D_PEcuw/view?usp=sharing))

In [6]:
# Importing Pandas
import pandas as pd

In [14]:
# Loading our Countries dataset
# 
with open('world_countries.csv','r') as f:
    world_countries = pd.read_csv(f, index_col=0, encoding='utf-8')
#%sql DROP TABLE if EXISTS world_countries;
%sql PERSIST world_countries;
%sql SELECT * FROM world_countries LIMIT 5;

 * sqlite://
 * sqlite://
Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

In [12]:
# Loading our cities dataset 
# 
with open('world_cities.csv','r') as f:
    world_cities = pd.read_csv(f, index_col=0, encoding='utf-8')
#%sql DROP TABLE if EXISTS world_cities;
%sql PERSIST world_cities;
%sql SELECT * FROM world_cities LIMIT 5;

 * sqlite://
 * sqlite://
Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

## 1.2 Subqueries using the SELECT statement

A subquery is a query within another query. The outer query is called as main query and inner query is called as subquery. The subquery must be enclosed with parenthesis and generally executes first, and its output is used to complete the query condition for the main or outer query. We will go through examples of how subqueries can be used to answers different types of questions then later, we will use our learnings to work on the challenges.

In [15]:
# Example 1
# Subqueries can occur in the select list of the containing query
# as shown below;
# Let's find all countries in the Countries table with no city in the Cities table
# 
%%sql
SELECT country
FROM world_Countries
WHERE NOT EXISTS (SELECT * FROM world_cities
                  WHERE world_cities.country = world_countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [19]:
# Example 2
# Find the European countries with cities experiencing temperature > 15?
# 
%%sql
SELECT country
FROM world_countries
WHERE EU = 'yes'
AND EXISTS (SELECT * FROM world_cities
            WHERE world_cities.country = world_countries.country
            AND temperature > 15)

 * sqlite://
Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

In [21]:
# Example 3: Method 1
# Find the westernmost city, returning the city and longitude
# 
%%sql
SELECT city, longitude
FROM world_cities C1
WHERE NOT EXISTS (SELECT * FROM world_cities C2
                  WHERE C2.longitude < C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [25]:
#my simple method
%%sql
SELECT city, min(longitude)
FROM world_cities

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [24]:
# Example 3: Method 2
# Find the westernmost city, returning the city and longitude
# 
%%sql
SELECT city, longitude
FROM world_cities
WHERE longitude = (SELECT min(longitude) FROM world_cities)

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [26]:
# Example 4:
# How many cities are in the EU?
# 
%%sql
SELECT count()
FROM world_cities
WHERE country IN (SELECT country FROM world_countries WHERE EU = 'yes')

 * sqlite://
Done.

[(150,)]

### <font color="green">1.2 Challenges</font>

In [34]:
# Challenge 1
# Find number of countries that have a city with latitude > 1000 (start with country list)
# 
%%sql
SELECT count(country)
FROM world_countries
WHERE EXISTS (SELECT * FROM world_cities
            WHERE world_cities.country = world_countries.country
            AND latitude > 1000)

 * sqlite://
Done.

[(0,)]

In [40]:
# Challenge 2
# Find three western most cities returning both the cities and their longitude
#
%%sql
SELECT city, longitude
FROM world_cities
ORDER BY longitude ASC LIMIT 5;

 * sqlite://
Done.

[('Lisbon', -9.14),
 ('Galway', -9.05),
 ('Vigo', -8.73),
 ('Cork', -8.5),
 ('Braga', -8.42)]

In [60]:
# Challenge 3
# Find cities with temperature is more than 50% higher than the average; 
# We will return the city, country, and temperature, ordered by descending temperature
# Hint: avg(temperature) * 1.5
# 
%%sql
SELECT city, country, temperature
FROM world_cities
WHERE temperature > (SELECT AVG(temperature)*1.5 FROM world_cities)
ORDER BY temperature DESC

 * sqlite://
Done.

[('Adana', 'Turkey', 18.67),
 ('Palermo', 'Italy', 17.9),
 ('Athens', 'Greece', 17.41),
 ('Algeciras', 'Spain', 17.38),
 ('Cartagena', 'Spain', 17.32),
 ('Kalamata', 'Greece', 17.3),
 ('Marbella', 'Spain', 17.19),
 ('Huelva', 'Spain', 17.09),
 ('Patras', 'Greece', 16.9),
 ('Cosenza', 'Italy', 16.6),
 ('Messina', 'Italy', 16.54),
 ('Granada', 'Spain', 16.33),
 ('Valencia', 'Spain', 16.02),
 ('Trikala', 'Greece', 16.0),
 ('Barcelona', 'Spain', 15.78),
 ('Badajoz', 'Spain', 15.61),
 ('Lisbon', 'Portugal', 15.52),
 ('Elbasan', 'Albania', 15.18),
 ('Bari', 'Italy', 15.15),
 ('Pescara', 'Italy', 15.13),
 ('Manisa', 'Turkey', 15.1),
 ('Rome', 'Italy', 15.1),
 ('Catania', 'Italy', 15.04),
 ('Denizli', 'Turkey', 15.02),
 ('Murcia', 'Spain', 15.0),
 ('Marseille', 'France', 14.98)]

In [66]:
# Challenge 4
# How many cities are not in the EU and without a coastline?
# Hint: "not in"
# 
%%sql
SELECT count()
FROM world_cities
WHERE country NOT IN (SELECT country FROM world_countries WHERE EU = 'yes' AND coastline= 'yes')

 * sqlite://
Done.

[(77,)]

In [64]:
# Challenge 5
# Find the number of countries with no coastline and a city with longitude < 10
# 
%%sql
SELECT count()
FROM world_cities
WHERE country IN (SELECT country FROM world_countries WHERE coastline= 'no' AND longitude < 10)

 * sqlite://
Done.

[(4,)]

In [71]:
# Challenge 6
# Find countries in Countries table with no city in Cities table
# 
#COMPLETE THE CODE BELOW

%%sql
SELECT country
FROM world_countries
WHERE NOT EXISTS (SELECT country FROM world_cities 
                   WHERE world_cities.country = world_countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [87]:
# Challenge 7
# Find all cities in a country whose population is < 2, returning the city and country.
# 
%%sql
SELECT city, country
FROM world_cities
WHERE country IN (SELECT country FROM world_countries 
                  WHERE world_cities.country = world_countries.country AND population < 2)

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

In [83]:
# Challenge 8
# Find all countries with no city having a temperature > 6
# 
%%sql
SELECT country
FROM world_countries
WHERE NOT EXISTS (SELECT * FROM world_cities 
                  WHERE world_cities.country = world_countries.country AND temperature > 6)

 * sqlite://
Done.

[('Cyprus',),
 ('Estonia',),
 ('Finland',),
 ('Iceland',),
 ('Kosovo',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Norway',)]